
## Plan Result

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220183363)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * pagerduty_user.pd_user[&#34;imparapoc03@gmail.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # pagerduty_user.pd_user["imparapoc03@gmail.com"] will be created
  + resource "pagerduty_user" "pd_user" {
      + avatar_url      = (known after apply)
      + color           = (known after apply)
      + description     = "Managed by Terraform"
      + email           = "imparapoc03@gmail.com"
      + html_url        = (known after apply)
      + id              = (known after apply)
      + invitation_sent = (known after apply)
      + license         = (known after apply)
      + name            = "Poc User"
      + role            = "limited_user"
      + teams           = (known after apply)
      + time_zone       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"d47d9026c9a53e45c21cffd7d385ce07b56d9a74","Vars":{},"WorkflowName":"Plan"} -->